---
type: FileDialog
namespace: Autodesk.Revit.UI
version: 2024
members: 8
tags: [revit-api, class]
---

# FileDialog

`Autodesk.Revit.UI.FileDialog` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSelectedModelPath | 2017 | `public ModelPath GetSelectedModelPath ()` |
| Method | IsValidFilterString | 2017 | `public static bool IsValidFilterString ( string filterString )` |
| Method | Show | 2017 | `public ItemSelectionDialogResult Show ()` |
| Property | DefaultFilterEntry | 2017 | `public string DefaultFilterEntry { get ; set ; }` |
| Property | Filter | 2017 | `public string Filter { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Title | 2017 | `public string Title { get ; set ; }` |